app/views/books/index.html.erb

          <td>
            <% book.category.each do |category_name| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "books_categories" ON "categories"."id" = "books_categories"."category_id" WHERE "books_categories"."book_id" = $1  [["book_id", 2]]