app/controllers/books_controller.rb

  def index
    @books = Book.search(params[:name]).order('updated_at DESC')
---
SELECT "books".* FROM "books" ORDER BY updated_at DESC